<?php include('../../../parts/header.php'); ?>
<h1>210816</h1>

<h3>雑感</h3>

<p>コロナに感染した。以下記録。  </p>


<h3>8/16 (Mon)</h3>

<p>0日目  </p>

<p>酷い関節痛で未明に起きる。  </p>
<p>明日のワクチンを打ってよいかコールセンターに確認し以下の回答。  </p>
<ul>
<li>発熱から 3、4日 経つまで公費検査は不可  </li>
</ul>
<ul>
<li>体調が怪しければワクチンはパスしてください  </li>
</ul>


<h3>8/17 (Tue)</h3>

<p>1日目  </p>

<p>特になし関節が痛い。  </p>


<h3>8/18 (Wed)</h3>

<p>2日目  </p>

<p>関節痛に対して整形外科に行くために薬局の検査キットで検査し陽性。  </p>
<p>この旨を発熱コールセンターに連絡し、発熱外来を斡旋され PCR 検査し陽性。  </p>
<p>事前に関節痛が酷い何か下さいと伝え鎮静剤を処方される（アセトアミノフェン 500mg）。  </p>


<h3>8/19 (Thu)</h3>

<p>3日目  </p>
<p>特になし関節の痛みが多少引いた。  </p>


<h3>8/20 (Fri)</h3>

<p>4日目  </p>
<p>関節痛はほぼ無し。  </p>
<p>シップのにおいがわからない。  </p>
<p>嗅覚が完全に無くなった。  </p>
<p>カレーを食べても、舌に乗せて味を感じるまで何も情報がない。  </p>


<h3>8/21 (Sat)</h3>

<p>5日目  </p>
<p>特に変化なし。  </p>


<p>（-- 以下特に変化なし --）  </p>


<h3>8/26 (Thu)</h3>

<p>10日目  </p>
<p>自宅療養期間が終了。  </p>
<p>一応14日目までは外出は控える。  </p>
<p>嗅覚が若干戻ってきた。    </p>


<p>（-- 以下特に変化なし --）  </p>


<h3>8/31 (Thu)</h3>

<p>15日目  </p>
<p>嗅覚がほぼ戻って食事が美味しい。  </p>


<p>/ / / / / / / / / / /  </p>


<p>気を付けていたが普通に感染した。  </p>
<p>いわゆる具合が悪いという状況にならず助かった。  </p>

<p>感染後のワクチンは、特に何かが決まっているわけではなく、主治医の判断でということなので自分でいつ打てるか確認しないといけないらしい。  </p>

<p>いつ打てるのだろうか。  </p>


<p>（終わり）  </p>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
