<?php include('../../../parts/header.php'); ?>
<h1>200903</h1>

<h3>雑感</h3>

<p>久々の在宅デーだったので、データ修正したり、プログラムを書きつつ、パスタを茹でて食べたり、細かな買い出しに出たり、洗濯を回したり。  </p>

<p>最近ほんとに太ってきたので、ユニクロでスキニーを買う。スキニーを頑張って履く。  </p>

<p>ヨドバシに回って Bluetooth アダプタを買ってみた。Bluetooth が無いデスクトップ PC 用に有線ヘッドホンを買おうかと思っていたが、安いのでこちらにしてみた。使ってみると、ワイヤレスはやはりとても便利。しばらく有線ヘッドホンはパス。  </p>

<p>gcode 周りは、頻繁に見ないと忘れてしまうので、自分の書いたプログラムを読む。  </p>

<p>模型の 3D プリント用のデータ修正は、届いたデータが想定と異なり、要らないところを消したり、モデルを作り直したりで結構苦労した。  </p>

<h3>3D Printing 建築模型</h3>

<p>先方は、SketchUp モデリングしているようで、SkecthUp はメッシュデータしか書き出せないっぽい。  </p>

<p>しかも、3D プリントを理解したうえでそれに合わせてモデリングしているわけではなかったので、内部空間や体積のない壁があり、ブーリアンもされていないデータで全く使えず、頂点だけピックアップしほとんど全部作り直し。  </p>

<p>一旦、正しいデータを作って送ったので今後はまともなデータが上がってくるといいな。  </p>

<p>SketchUp でのデータが信じられないので、見積もりは高めに出すことになるよね。。。   </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>3D Printing 建築模型  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
