<?php include('../../../parts/header.php'); ?>
<h1>200902</h1>

<h3>雑感</h3>

<p>200831 に話をもらっていた 3D プリント建築模型の話がちょっと進んでまずデータをもらって、ちょっと様子見。データが重すぎて開けないので、明日デスクトップ PC でやる。  </p>

<p>道玄坂で次のイベントの打ち合わせ。  </p>

<p>ここまでの企画やプログラム作り、システムの設計もとても大変だったんだろうなと思った。  </p>

<p>4月以降、なんでもオンラインでとなってきたが、ただ視聴するだけでなく工夫次第で満足感がだいぶ変わるという気持ちと、個人的にはシステムを理解してから能動的に楽しむのが正解として設定されているとそれは疲れるという気持ちが半々くらいある。  </p>

<p>（極論中身が大事なわけで、新しいツールで新しい体験をするのこそが良い、新しいツールを使いこなしている方が偉いというのが、結構ストレスに感じてしまう時もあるよね。。。）  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>3D Printing 建築模型  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
