<?php include('../../../parts/header.php'); ?>
<h1>200401</h1>

<h3>雑感</h3>

<p>昼11時に小野さんからの、「君の同世代の人間は新社会人生活始まったというのに、お前まだ寝てるんかい（意訳）」という電話で起床。  </p>

<p>昨晩は、Threejs の勉強をした。普通のジオメトリと、webGL の低レベルに近いバッファージオメトリがあるとか知った。  </p>

<p>夜更かしをしてしまって昼に起きてみたいなメリハリのない生活は良くので、記録のためにも、日報的なもの作ろうと思った。  </p>

<p>あとは、家計簿的なものをスプレッドシートに作った。普通に現状維持でも大変という感じなので、コロナが収まってくれないと詰むなって気持ち。出て行くお金を可能な限り絞るしかないな。  </p>

<p>日付変わって朝4時。寝る。明日は研究室に顔を出そうと思った。  </p>

<h3>日報用のシステム</h3>

<p>まじで暇なので、日報用のシステムを自作する。想定は、1日1ファイルで、マークダウンで書いて Git で管理（1日の中でも気合いを入れて更新しよとか思ったり）。</p>

<p>マークダウンから HTML に変換し、トップページにはリンクを挿す。実装する機能としては、マークダウン HTML 変換（これはすでにいくらでもある）と、トップページへの自動でのリンク追加だと思う。  </p>

<p>それに加えて、普段は Cyberduck.app を使って、サーバへアップロードしているので、サーバに SSH でアクセスして CUI で操作するように変えたい。SSH キーを生成して、公開鍵を GitHub に登録してみたいなのとかやった。  </p>

<h3>反省</h3>

<p>Processing Commuunity Day の人たちがやってる、 DailyCodingChallenge をやろうと思っていたが、Rhino でのモデリング仕事がうまくいかず心折れたので断念。  </p>

<h3>積みタスク</h3>

<ul>
<li>日報システムの実装（Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day1  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>

<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
