<?php include('../../../parts/header.php'); ?>
<h1>200821</h1>

<h3>雑感</h3>

<p>RISO 展示設営日。  </p>

<p>毎度のことながら、23時半くらいまでかかってしまった。  </p>

<h3>RISO 展示設営</h3>

<p>まずは、東急ハンズで買い出し。ハンズに行く前に値段や個数など確認していても、値段や在庫の少なさなどで想定外が発生すると結構焦ってしまう。今回の想定外は、ピクチャーレールのフックが150円くらい想定が550円で、130個必要なダブルクリップが在庫100個だけ。  </p>

<p>炎天下の中、道玄坂を登って、下準備の工作。  </p>

<p>位置が決まる様に長さが完璧な（調整できない）ワイヤーセットを量産する。ちゃんと作ると意外と綺麗。  </p>

<p>次に、今までやったことない吊りメンバーの製作。リーズロックで吊りメンバーの水平を出して、さらにその下の吊り物の水平をリーズロックで出すので、冗長ではある。吊りメンバー下の部分は長さが完璧なワイヤーでやっても良かった。壁の天井に近い方が白く塗られていて下の方は打ち放しなところに、今回は、打ち放しの方に無垢の栂（24mm x 30mm）の吊りメンバーをつけたが、白く塗られた方でも良かったかも。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
