<?php include('../../../parts/header.php'); ?>
<h1>201120</h1>

<h3>雑感</h3>

<p>手首の疲労感から解放されるも、寝付かれて腰が痛い。  </p>

<p>パソコンに向かい、いくつかコードを整理するも、結局重いコンポーネントは重いので（Rhino6 になり、コンポーネント単位でマルチスレッドで動くようになっていたとしても）、軽くするにはアルゴリズムを変えるしかなさそう。。。  </p>

<p>強い CPU のマシンで動かすと多少早そうなので、もう少しパフォーマンスを調べたい。というか、小野さんはコンポーネント単位でのパフォーマンスを見ていないらしい。それをやらずにここまでやって来たの？と思うことが何度かあるので、逆にすごいなと思う。  </p>

<p>この間見つけた立体充填は、要件を満たしていたらしい。良かった。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
