<?php include('../../../parts/header.php'); ?>
<h1>200913</h1>

<h3>雑感</h3>

<p>日曜日。今日は添田さん展示の設営日。  </p>

<p>200901 / 200908 に2回ほど打ち合わせをしているので不透明なところはたぶんあまりないはず。  </p>

<p>だらだら帰宅すると小野さんから電話があり、地味に面倒なラティスのデータ修正、処理待ちも多く終わったのは結局朝の5時。  </p>

<h3>展示設営</h3>

<p>レジ前の壁の、多少手間がかかるディテールの部分は、太いドリルビットを買ってあったので、機材的には問題ないはずで、まあやってみようという状態で当日。  </p>

<p>壁のセパ穴には、5/16 インチのネジが埋まっているので、5/16 - M8 の変換の高ナットで接続しようとしていたけど、変換の高ナットは、ハンズで 1個 400円だったので避けて、5/16 インチのボルトナットのセットを購入した。  </p>

<p>ワンバイフォーの木材の小口から150ミリくらいのところに、直径 18mm のドリル穴をあけたらやっぱり割れたので、MDF で接着で誤魔化す。  </p>

<p>オスメスのひっかけ式の金具を買っていたが、これでは水平を出すのがとても難しいうえに、壁までの距離が近く高い位置だったのではめるのが結構大変だった。  </p>

<p>結局水平は両端の穴を広げ据え付け位置を無理やり調整し、対応。。。  </p>

<p>そのほかはたぶん想定の通りに進み、順調に設置が終わり、ライティングや位置確認などを余裕もってできた。  </p>

<p>個人的には、やり残したと思う部分もなく良い設営ができたと思う。良かった。  </p>

<p>設営で重いものを運んだこともないがなんか腰が痛い。。。  </p>

<h3>ラティスのモデリング</h3>

<p>ラティスのモデリングでは、バウンディングボックスベースで計算する3次元ボロノイから、ターゲットの形状に合わせてカーブを切り出す必要がある。  </p>

<p>交差判定で切り出す際に、ターゲット形状の輪郭と交差しているものは交差の点が出力されるが、カーブの全てがターゲット形状の中or外にあるものは、特に触られない。  </p>

<p>このため、完全に内部にある or 境界面と交差する or 完全に外部にあるものでまず分類する必要がある。  </p>

<p>今回のような細かなセルの場合、始点と終点がそれぞれが、ターゲットの内部にあるか、外部にあるかで判別すればよい（細かなことを言うと、始点と終点がターゲットに入っているが中間でターゲットの外に出ることもある、が、今回のスケール感ではこれは出ないか、無視してもいい）。  </p>

<p>これはナイスアイデアだなあと思っていたが、あとで小野さんに話すと、俺もそうしてるよと言われちょっと萎えた。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
