<?php include('../../../parts/header.php'); ?>
<h1>200805</h1>

<h3>雑感</h3>

<p>200629 に話をもらっていて、徐々に進んではいる仕事（？）で、目指しているものと近しい商品がを扱っている販売代理店に実物を見に行く。  </p>

<p>とてもスマートで、手動での入力などあったら良いなという機能もついていてとてもよかった。  </p>

<p>悪い意味で気になる点は1つ。パソコンからのシーケンスを流して動かすということができない。僕が使うならばこれは嫌。  </p>

<p>手で動かせば動かせる動かしたらその位置で止まる機構はどのように作られているかとても気になる。ステッピングモータであれば、通電していると動かせないし、通電していなければたぶんフラフラ。  </p>

<p>ちょっとほかのものも探ってみるかな、、。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>Auto GUI Tool の開発  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
