<?php include('../../../parts/header.php'); ?>
<h1>201216</h1>

<h3>雑感</h3>

<p>配信スタジオの設営。  </p>

<p>不意に誘われたのでなんとなく設営に参加。  </p>

<p>一昨年の夏に購入していた部品を使って、ネオン管のオブジェようなものを組む。  </p>

<p>素材は、LED 蛍光管にカラーフィルムを貼ったものと、コンクリートブロックと L 金物 + フラットバーとインシュロック。このコンクリートブロックがなかなか優れもので、上部にスリットがいて、そのスリットに M12 の六角ボルトがピッタリで供回りを防ぎ、スリットの外からナットを締めることができる。これに L 金物を固定し、フラットバーを接続すると、自由角度の土台が完成する。そこに LED 蛍光管を転倒しないように三角系を作っていくと形が作れる。  </p>

<p>そして、会場はフィリップスの Hue で自由に照明の色を作れるので、ピンクに。補助灯として、画面を通して見た時の抜け感とか、欲しいディテール感とか見ながらスポットを足す。  </p>

<p>僕は当日設営に参加しただけなので何も考えていなかったが、あのクオリティできちんと作るようにあれこれ考えていた人たち、すごいなと思いました。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
