<?php include('../../../parts/header.php'); ?>
<h1>200914</h1>

<h3>雑感</h3>

<p>腰が結構痛い。  </p>

<p>腰が曲がらないので靴下を履くので一苦労。これはやばいかという気持ちでマツキヨへ湿布を買いに走る。  </p>

<p>用事を済ましつつ道玄坂へ。  </p>

<p>いろいろ試し疲労困憊（僕は責任もないのでそうでもなかったけど）。  </p>

<p>オンラインでというもののノウハウをためることに意味があるのか、ワクチンができるまでは昔は人々が集まれることができたんだよという世界になるのね、など話しているのを聞いていた。  </p>

<p>オンライン疲れ、オンライン飽きは僕は結構来てる。  </p>

<p>が、Punpee の生配信ライブが良かったというのを見たので、見逃し配信を買おうと思ってる。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
