<?php include('../../../parts/header.php'); ?>
<h1>200228</h1>

<p>（コロナで一気に変わる直前の2月末になんとなく記録を書き留めたものを見つけたので、こちらに書きます。）  </p>

<h3>雑感</h3>

<p>2月15日から始まった大きな仕事（YouFab 展示の設営）が終わった。設営最終日（27日）の23時30分までやってもやり残しがあり、展示の始まる当日の開始11時直前まで細かな作業を。  </p>

<p>無事、会期に突入し、ここもう少しいけたかもねとか、良い仕事ができたね、とのんびり話していたら、森美や、21_21 をはじめとした商業ベースの美術館が新型コロナウイルス感染防止ということで閉館を決めたというニュースが流れてきた。  </p>

<p>YouFab でも、アーティストの来日がなくなったり、レセプションがなくなったり、受賞パーティーを縮小したり、多少の影響はあったが、入場料を取って回している美術館を閉めるのは大事ですよと話す Y さんの話を聞きながら、コロナ結構来たな、と、大きく実感した気がする。  </p>

<p>残す会期が3日間程度の ICC も、今日の夜までは開けて明日からは休むと告知されてた。見ておきたかったので、初台までダッシュで滑り込み。渋谷から初台はバスで一本。  </p>


<h3>関連データ （200823 に調べたものも含む）</h3>

<p>研究室にて、感染リスクを検討しつつ大きなイベントへ出展。ロボデックス ロボット開発活用展 @東京ビックサイト。（2月12日-14日）  </p>

<p>政府による2週間のイベント自粛要請（2月25日）  </p>

<p>2月末までの感染者の合計 239人、うち東京都は29人。（m3.com編集部）  </p>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
