<?php include('../../../parts/header.php'); ?>
<h1>200901</h1>

<h3>雑感</h3>

<p>火曜日。  </p>

<p>大事な報告と予告されていたので、池尻に。想定の何段も上をいく感じの報告で完全に意気消沈、、。  </p>

<p>ぐでぐでになりながら、友人（というか先輩）の会社の新オフィスへ。  </p>

<p>みな思うこと言いたいことは同じで笑える話であるが、本当にいつか笑い話になるように頑張りたいです。  </p>

<p>夕方は次の展示計画の打ち合わせ。大きな設営が昨日終わったんだけどもすぐに次が来る。  </p>

<p>たぶん10回以上設営をしているので1階の店舗の寸法感や設置に使えるものがわかってきて、できることとできないことがわかってくる。  </p>

<p>僕からは店舗で出来ることベースで話すことになるが、展示を行う人にとっては想定していたことができないという感じになってしまうこともあるのでなんか申し訳ないと思ったり。  </p>

<p>ついでに、展示を見に来る人が訪れるホワイトキューブではなく、不特定多数がカフェとして利用しにくる場ということもあり、安全性とか店舗での動線とかそのような制限もあるのでその辺も難しいですねという感じ。  </p>

<p>いくつか計画が変更になってしまうと思うが、頑張ってください！と待つしかないのでまあ待機。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
