<?php include('../../../parts/header.php'); ?>
<h1>200407</h1>

<h3>所感</h3>

<p>昼に起きた。昨日に引き続き、大掃除。床に物を置かない、2年間開いていない本は捨てるなど、ガツガツ荷物の整理。引っ越して以来一番綺麗な状態になった。</p>

<p>部屋着からの着替えも始めた。家活動が増えるので、スウェットを買い足していたが、部屋着 = 家 = 寝る、みたいな感覚が身についてしまっているので、家での作業の日も、部屋着と、そうでない外に出る格好の着替えによって意識をに切り替えることにした。  </p>

<p>フルカラーの実装を、17時から、途中で食事を挟んで、朝4時まで。とりあえずコア部分の実装を終えたのであとは、連番処理とか書くのを残すのみ。  </p>

<h3>フルカラー</h3>

<p>RGB &gt;&gt; CMYK の変換を書いた。なんとなく Python の高速化みたいのものを調べ始め、Cython 経由での高速化を調べて試した。本番環境ではないので、特に意味がないかもしれない。高速化に関しては、ライブラリ関係がどうなるかわからないので続きはまた今度。  </p>

<p>メインの画像処理部分に取り掛かる。柔軟な設計 &lt;-&gt; 曖昧な仕様になってしまって右往左往。紙に工程を書き出し、プログラムの設計を進める。  </p>

<p>がんがん書かなきゃ終わらないなと思って、気合いを入れてほぼ集中を切らさず一気に書くことができた。基準の点からの NxN ピクセルの領域をランダムに取り出して埋める時に、あらかじめベクトルのリストを作っておいて、都度都度、順番をシャッフルして、頭から取り出して配する部分は、結構綺麗に書けた気がする。  </p>

<p>実行してみると明らかに色が薄く、ちょっと考えると、CMYK カラーの仕様かと気が付いた。 CMYK カラーは、シアン、マゼンタ、イエローの混色で、全ての色を作ることができるが、この混色では、綺麗な黒が作れないため、黒を含めてカラーモデルとしている。そのため、CMYK の総和を 400(= 100 x 4) として、混色の具合を考えると、色が薄くなってしまう。CMY で総和を 300(= 100 x 3) として進めるとする。追加で、カラコレ用に補正用の値を組み込んでおいた。  </p>

<h3>積みタスク</h3>

<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day1  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day2  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day3  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day4  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day5  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day6  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day7  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
