<?php include('../../../parts/header.php'); ?>
<h1>200816</h1>

<h3>雑感</h3>

<p>日曜日。連休最終日っぽい。  </p>

<p>昨日の続きでボクセル関係。下処理が終わっているので、擬似 3D 描画のパートを書く。  </p>

<h3>フルカラーボクセル環境の準備</h3>

<p>輪切り断面の図を、を斜め上から見た図に変換するには、アフィン変換というものでやると良さそう。  </p>

<p>アフィン変換とは、「既知の行列 A とベクトル t を用いて線形変換 y = Ax + t により点 x を点 y に写像する。Collinearityを保存 : 直線は必ず直線に写像される。回転、平行移動、拡大縮小、シェアリングの組(反転・相似含)で構成される（九大吉澤先生の授業資料より）」の様なものらしい。  </p>

<p>回転、平行移動、拡大縮小、シェアリングの組(反転・相似含)を、行列として掛け合わせて狙った形へ変更できるので非常に簡単（高校数学の行列を復習しました）。なんとなく、思っていた様な変形になっていないが（狙った比率にならない）、PhotoShop で、斜め上からの図に見えるか確認すると、特に問題なさそうなので、これでよしとする。  </p>

<p>あとは、連番での描画処理。ただ位置を決めて貼るだけなので秒殺だと思う。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>Auto GUI Tool の開発  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
