<?php include('../../../parts/header.php'); ?>
<h1>200404</h1>

<h3>雑感</h3>

<p>昼に起きて、布団でスマホで資料を読みながらダラダラして、気づけば夕方。明日こそは、朝起きて、朝から机に向かう生活に切り替えていきたい。  </p>

<p>フルカラープリントについて資料を読んでいて、昨日までの認識が間違っていたと気が付いた。が、多少柔軟な実装をしてあるつもりので、多分大丈夫。これから作るべき機能の設計などもついてに考える。  </p>

<p>PHP をもう少し書いた。SQLite 系の自前ワードプレスもどきとかもこれできるなって感じ。javascript &lt;-&gt; PHP の勘所を掴みたい。 </p>

<p>積みタスクは減ってないので明日こそ。  </p>

<h3>フルカラープリント</h3>

<p>入稿マニュアルを熟読した。ボクセルで入稿というが、ここでいうボクセルとは、立方体の配列ではないとわかった。とりあえず実装は問題なし、さらに画像で作っているので、最後に画像処理に突っ込めば万事解決だと思う。  </p>

<h3>PHP の実装</h3>

<p>PHP を書いている理由として、ファイルを分割してコードの共通化ができる点を先にあげていたが、昨日、ワードプレスは動的でどうこうみたいな話をして、フォルダ内のデータを更新しても動的にディレクトリを走査して、リンク先の一覧を表示できるなって気が付いた。  </p>

<p>Python で、ディレクトリからファイル名を取得して、HTML に出力という実装をしていたので、それを PHP に書き直すだけで、関数さえググれば簡単だった。ワードプレスなんもわからんと言っていた2年前からの成長を感じる。  </p>

<p>プログラミングのスキルとか、僕が何か語るのは出来ないくせに何言ってるの？という感もあるが、ここ2年くらい適当にやってきた所感として、なんとなく関数が予測できて、ググり方がわかってきて、デバッグの仕方もわかってきて、必要な機能の設計ができて、そうなってくると最低限ことなら困らないなと感じ。過信かもしれないけど。  </p>

<h3>積みタスク</h3>

<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day1  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day2  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day3  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day4  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
