<?php include('../../../parts/header.php'); ?>
<h1>200814</h1>

<h3>雑感</h3>

<p>小野さんのおこぼれで、UT の N 先生に研究室を案内していただく。工学部2号館がとても綺麗だった。研究者の方々は皆、知的好奇心のもと、的確な質問を繰り出していて、どこの誰とも似た様な会話をすることになるが、適切なキャッチボールは心地よいなと思った。  </p>

<p>午後は、道玄坂 へ。なんとなくいけるんじゃないかというボクセルの擬似 3D 描画アルゴリズムを思いついて、いくつか関数を設計したり、ファイルの確認など行う。すでに実装済だと思っていた関数が def hogehoge(): pass とだけ書いてあったり、過去の自分に期待しすぎた。  </p>

<p>とりあえず、ただ書いたら終わるものからガリガリ書く。  </p>

<h3>フルカラーボクセル環境の準備</h3>

<p>まずは、下準備のために、グレースケール化、2値化、トリムして保存など。これは、調べて一度書いたら終わりなので秒殺。これで綺麗な元データができたので明日から、3D 描画システムの方に手をつけよう。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>Auto GUI Tool の開発  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
