<?php include('../../../parts/header.php'); ?>
<h1>200403</h1>

<h3>雑感</h3>

<p>目覚ましをかけて朝起きた。フルカラープリントに向けて必要な工程、テストデータを考えつつ、用意をして池尻へ。荷物を受け取り、FabCafe に寄る。池尻に戻って、小野さんたちと世間話をした。  </p>

<p>ザ・正統派、プロパーな勢力に対して、非プロパーの我々はどうやって戦っていくか、という話を最近よくしている気がする。勝てないからと消去法で捨てるところがあっても、譲れない部分や、こだわり、勝つぞって気持ちとか持っていきたい。  </p>

<p>今日は話していないが、僕は、先人がソフトハード共に貧弱な時代に荒野を切り開いて整備してくれた遊歩道に、我々はタダ乗っているだけ。先人に比べて、我々ツールユーザ世代は、腕力が違いすぎるのでまじで頑張らないといけない、的な話も最近色々なところで繰り返し口にしている気がする。これは本当に行動に移していきたい。  </p>

<p>積みタスクは終わらない、明日は1日机に向かうように努力する。  </p>

<h3>フルカラープリント</h3>

<p>連番画像による擬似ボクセルが必要。ライノで、ターゲットのメッシュの切断線を求めて、連番画像書き出しを想定しているが、これではボクセルの隠せるの W / H / D のスケールが合わない。連番画像で書き出すのであれば、書き出す枚数が固定でこれが解像度になる。つまり、高さ 500 で 500枚の連番画像ならば、各画像の解像度 500x500 になるようにする必要がある。  </p>

<p>あとは、ライノでメッシュのコンターで切断面を導出するならば、色指定は別の方法になる。前者でマスク、後者で色、これらを重ね合わせる。マスクの方の連番画像は、2値化させておくのが安全。マスクを Processing で数理的につくったので、明日は色を重ねて、出力データを作る。  </p>

<h3>積みタスク</h3>

<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day1  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day2  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day3  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
