<?php include('../../../parts/header.php'); ?>
<h1>200831</h1>

<h3>雑感</h3>

<p>RISO 設営日。明日から販売開始なので、すべてのポスターを設置していく。  </p>

<p>朝一で、神保町のタケオストアへ受け取りへ。余裕があるときに神保町行きたいなと思ったり。  </p>

<p>昼過ぎから、昨日に引き続き Zine の折り込みや袋詰めの内職。昨日の作業でだいぶ慣れているのでこれは簡単。  </p>

<p>店が閉まるタイミングで、ポスターの入れ替えや、梁上のポスター設置など。慣れているといえば慣れているがまあ綺麗にやるのはちょっと頑張らないといけない。結局 24時ギリギリに終了。ダッシュで終電に飛び乗る。  </p>

<p>電車で学部の友人から、建築模型の 3D プリント相談の連絡が来る。3D プリント相談に答えた回数はもう数えきれないくらいなので（大袈裟）、本当にすらすら答えられる。  </p>

<p>あらかた説明しつつ、まあ予算があるならば僕が仕事として受けてもいいよという感じ。  </p>

<p>ちょうど、僕も詳しい人に相談に乗ってもらってということがあったので、身近に困っている人がいればできるだけ真摯に対応するようにしていきたい。  </p>

<p>今日で8月も終わりですね。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
