<?php include('../../../parts/header.php'); ?>
<h1>200407</h1>

<h3>所感</h3>

<p>昼に起きた。昨日書いたコードを読みつつ、洗濯など。外に昼ごはん + 買い出しに出たら、近所のコンビニのイートインでは、ご高齢の方々が、幾つもの席に分かれて食事を楽しみつつ歓談していた。普通にすごいなって思った。スーパーはかなり混んでいた。パスタは無いし、手を洗うためのハンドソープ的なものも売ってない。  </p>

<p>玄関の照明のために、センサー付きの電球を買ったが、適当に買ったら、明暗センサーとかいう暗くなったら点いて明るくなったら消えるというものだった。スイッチの操作が面倒 + 電気代の節約のためセンサー付きを買ったはずなのにはこれでは意味がないので、人感センサー月を新たに発注した。  </p>

<p>フルカラーの実装の続きのために机に向かう。実験用のデータを用意し、出力や、パフォーマンスを探る。パフォーマンスは問題無し。カラーコレクションなど追加した。小野さんから進捗確認があり、CMYK での印刷の仕方について自分で口に出しているうちに、ベターな実装方法が思い浮かぶ（これは多分手間）。  </p>

<h3>フルカラー</h3>

<p>Lena を始めとして、いくつかの試験データを突っ込み試験。カラーコレクションと、カラーモードなどいくつかの機能を追加。  </p>

<p>CMYK の混色の仕方、今は、設計画像の1画素を取り出し、それを NxN の領域に分けて、CMY を割合に応じて流し込んでいるが、これでは薄い色で白が目立つ。これではなく、C、M、Y のそれぞれのレイヤーに分けて、3レイヤーセットで擬似的に1レイヤーとする。そうすることで、不用意に白が出ないと思う。結構書き直す必要があるが、これがベターかと。積層ピッチの3倍でのコンターを作って、1_C, 1_M, 1_Y, 2_C, 2_M, 2_Y ... のように重ねると良さげ。  </p>

<p>球体のコンターのデータを数値計算で解く。平面方向で、ピクセル数で出力物の大きさが決まるのだけど、積層ピッチは、mm 単位であったりで少し混乱した。次は気をつける。  </p>

<p>明日は、画像の合成処理の部分の実装をする。特に大変なことはないので書くだけ。プレビュー JS もついでに作ろうと思う。  </p>

<h3>積みタスク</h3>

<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day1  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day2  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day3  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day4  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day5  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day6  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day7  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day8  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
