<?php include('../../../parts/header.php'); ?>
<h1>210210</h1>

<h3>雑感</h3>

<p>水曜日。  </p>

<p>今日も銀座方面へ。  </p>

<p>わかったつもりで動かしてみてもうまくいかず、雑に原因を追いかけてしまうと、うまくいかない。  </p>

<p>多少慣れてきたので、もう少し正確に進めるためのログ出力を作ったり、メモや記録のつけ方を考えたり、うまく進めるための治具を考えることができた。  </p>

<p>明日は休みで金曜からは、リモートワークに。  </p>

<p>なんとなくではあるが、正しい追い込み方や、間違えにくい進め方、報連相しやすい進め方を掴めつつある気がするのと、聞いておきたい部分を多く質問したので家でも頑張ろう。  </p>

<p>帰りに、隈研吾設計の歌舞伎座を見た。白くてでかい。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
