<?php include('../../../parts/header.php'); ?>
<h1>200822</h1>

<h3>雑感</h3>

<p>土曜日。  </p>

<p>昨日の設営の疲れで、寝て過ごす。  </p>

<p>やります！と宣言したちょっとした仕事があり、無理やりパソコンにかじりついて、レーザー加工で作る可愛い文字のデータ制作をする。  </p>

<h3>レーザー加工の可愛い文字の制作</h3>

<p>加工に時間がかかるのはダメという要件に加えて、文字の切り抜きでは芸がないし、変に切り落ちてはおしゃれでない、と、地味なこだわりを持ってやる。  </p>

<p>リファレンスとしてあげていた僕の昔作った LOVE のパターンは、今回のサイズでは細かすぎるし、切り落ちや加工時間の問題があるので、新ネタを探す。  </p>

<p>ひとつ目のネタは、鍵盤ハーモニカを使うミュージシャン、ゆnovtion のロゴ。丸みのある「ゆ」の文字に厚みのついたロゴ。作ってみると結構好き。ただし、今回の切り落ちを防ぐために点線に。これは、加工に時間がかかるのでナシかな。  </p>

<p>二つ目のネタは、アパレルブランド「COS」のロゴの様な、ドロップシャドウだけ書くことで文字を浮かび上がらせるもの。これは加工が早いのでとても良さそう。店頭のスタッフが加工した実物を見ると、切れ目の部分から、髪の向こう側が見えてとても良さそうだった。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
