<?php include('../../../parts/header.php'); ?>
<h1>201130</h1>

<h3>雑感</h3>

<p>朝一で墨田へ。  </p>

<p>いくつか確認事項について話したり、施設の使い方講習を受ける。  </p>

<p>夕方に道玄坂にて打ち合わせ。  </p>

<p>手癖のようにすぐに進めることができる、且つ、勝てる上手くいくパターンをすぐにやれるというのは尊いことやな、的なことを考える。  </p>

<p>自分の考え方と合わせて失敗しやすいパターンを選択しないようにする、それに気づかず、正しい努力をしていると本人が思っているときに、外野はどうしたら良いのだろうか（自分もそういうときがあるかもしれないので自戒を込めて）。  </p>

<p>同時並行で、手元で、あれやこれや手放すために、プロジェクトを分割しソースコードを整理を始めた。休み休みでも似たようなことを2年くらいやっていると、あとから見返してもこれ良くできているなと思う部分もあり、自分の成長を感じる。  </p>

<p>綺麗に完璧に手放したい。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
