<?php include('../../../parts/header.php'); ?>
<h1>200405</h1>

<h3>雑感</h3>

<p>11時頃に起きた。外でご飯を食べて、ネットサーフィンしたり、昼寝をしたりして、いつの間にか夜になっていた。昨日の続きでフルカラーについての作業を進める。  </p>

<p>フルカラーについては、仕様書を読む作業が終わった。昨日の大きさについてもそうだが、ボクセル入稿や、フルカラープリントの仕様について、大きなの誤認識をしていたので、結構つまづいた。ここまできたら設計、実装を頑張るのみ。  </p>

<p>毎日書いているが、積みタスクが一向に減らない。自分は、マルチタスクできない人間なんだなって思ってしまうが、そんなことよりも一つずつ終わらせるしかないのでやる。  </p>

<h3>フルカラープリント</h3>

<p>てっきり、マテリアル用の連番と、色用の連番を2種類用いて、マテリアルの指定と着彩の指定を行うのかと思っていたけど、CMYK の色付きマテリアルを、ブロックのように積むっぽい、誤認識をしていた。  </p>

<p>物質的な混色という概念ではなく、青と黄色をうまく配したら、視覚的に緑として見えますよね、という仕様っぽい。ここまで、わかったので書くべきプログラムが見えてくるので、明日一気に書こうと思う。  </p>

<h3>積みタスク</h3>

<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day1  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day2  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day3  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day4  </li>
</ul>
<ul>
<li>DailyCodingChallenge Day5  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
