<?php include('../../../parts/header.php'); ?>
<h1>201114</h1>

<h3>雑感</h3>

<p>土曜日。  </p>

<p>木村の家にゲームをしに、笹塚へ。  </p>

<p>ニンテンドースイッチを初めて触って、スプラトゥーンをしたが、ジャイロ操作での視野変更ができず、勝てない。  </p>

<p>リングフィットアドベンチャーという体を動かすゲームも触ったが、デフォルトのコントローラにいくつかセンサーが積んであったり、後から発売のハードウェア（この場合はリングフィットのリング）から電子接点から必要なデータを出し入れできたり、発展させる余地を持ったハードが設計され売られていて、任天堂すごいな（当たり前だけど）と思いました。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
