<?php include('../../../parts/header.php'); ?>
<h1>201215</h1>

<h3>雑感</h3>

<p>2020/12/02 に引き続き、プロトタイピング WS。  </p>

<p>前回、うまくファシリテーションを行なっていた人の姿を想像し、多少うまく回すイメージを作れていたのかなと思う。  </p>

<p>今日の内容から、研究同様に、これは何が売りであるかを端的に示すにはなんと言うべきかみたいなことを考える、つまり、考えついた時の自分の面白さとは別の視点で客観視し、端的に表現すると言うことを、僕は普段から意識的にやっているのかもしれないと思った。  </p>

<p>しかしこれは、客観視と言っても自分の視座の上でと言う部分もあるので、本当の意味できちんとできているかも考えたい。客観視してるつもりでもできていなければ、はたから見れば無理やりの肉付けだと思う。気をつけたい。  </p>

<h3>積みタスク</h3>

<ul>
<li>gcode リファクタリング（Rhino + Python）  </li>
</ul>
<ul>
<li>フルカラーボクセル環境の準備  </li>
</ul>
<ul>
<li>PEmbroider の検証  </li>
</ul>
<ul>
<li>threejs  </li>
</ul>
<ul>
<li>Rhino + cs  </li>
</ul>
<ul>
<li>diary-updete, previous + next  </li>
</ul>
<br><br>
<p><a href="../../../">back</a></p>
<br>
<?php include('../../../parts/footer.php'); ?>
